In [2]:
import pandas as pd
import numpy as np

In [3]:
series = pd.Series([1,3, 5, 6, 8,  np.nan])
series

0    1.0
1    3.0
2    5.0
3    6.0
4    8.0
5    NaN
dtype: float64

In [4]:

df = pd.DataFrame({'A': [1,2,3,4,5,6,7,8,9],
                   'B': [11,12,13,14,15,16,17,18,19] 
})
df

   A   B
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15
5  6  16
6  7  17
7  8  18
8  9  19

# Creating a DataFrame by passing a NumPy array with a datetime index using date_range() and labeled columns:

In [5]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
dates.shape

(6,)

In [7]:
df = pd.DataFrame(np.random.randn(6, 5), index=dates, columns=list("ABCDF"))
df

                   A         B         C         D         F
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547
2013-01-05  0.132034  1.333239 -0.425538 -0.541836  0.890689
2013-01-06  0.686671  1.609725  0.575006  0.272954 -0.717013

# Creating a DataFrame by passing a dictionary of objects where the keys are the column labels and the values are the column values.

In [8]:
df2 = pd.DataFrame(
    {
        "A": 2.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  2.0 2013-01-02  1.0  3   test  foo
1  2.0 2013-01-02  1.0  3  train  foo
2  2.0 2013-01-02  1.0  3   test  foo
3  2.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

# Viewing data

In [10]:
df.head()

                   A         B         C         D         F
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547
2013-01-05  0.132034  1.333239 -0.425538 -0.541836  0.890689

In [11]:
df.tail()

                   A         B         C         D         F
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547
2013-01-05  0.132034  1.333239 -0.425538 -0.541836  0.890689
2013-01-06  0.686671  1.609725  0.575006  0.272954 -0.717013

In [12]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D', 'F'], dtype='object')

In [14]:
df.describe

<bound method NDFrame.describe of                    A         B         C         D         F
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547
2013-01-05  0.132034  1.333239 -0.425538 -0.541836  0.890689
2013-01-06  0.686671  1.609725  0.575006  0.272954 -0.717013>

Return a NumPy representation of the underlying data with DataFrame.to_numpy() without the index or column labels: Numpy Array have one dtype for entire array while Dataframe have onedtype per column

In [15]:
df.to_numpy()

array([[ 0.34721939, -0.51960916, -0.69071403,  0.38368705, -0.74637764],
       [-0.99432531,  0.17698165, -0.67825963, -1.06807532, -1.1840599 ],
       [ 0.43459397,  2.08517487, -0.66968458,  1.26882883, -0.50645766],
       [ 2.6828339 , -0.41106956,  0.93882092, -0.73684052,  0.23854728],
       [ 0.13203391,  1.33323906, -0.42553819, -0.54183625,  0.89068895],
       [ 0.68667139,  1.60972513,  0.57500605,  0.27295373, -0.71701312]])

In [16]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [17]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
F    float64
dtype: object

In [18]:
df2.to_numpy()

array([[2.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [2.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [2.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [2.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [19]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [20]:
df.describe()

              A         B         C         D         F
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean   0.548171  0.712407 -0.158395 -0.070214 -0.337445
std    1.198475  1.108318  0.725006  0.869410  0.761144
min   -0.994325 -0.519609 -0.690714 -1.068075 -1.184060
25%    0.185830 -0.264057 -0.676116 -0.688089 -0.739037
50%    0.390907  0.755110 -0.547611 -0.134441 -0.611735
75%    0.623652  1.540604  0.324870  0.356004  0.052296
max    2.682834  2.085175  0.938821  1.268829  0.890689

In [21]:
df.head()

                   A         B         C         D         F
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547
2013-01-05  0.132034  1.333239 -0.425538 -0.541836  0.890689

## Transposing your data:

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.347219   -0.994325    0.434594    2.682834    0.132034    0.686671
B   -0.519609    0.176982    2.085175   -0.411070    1.333239    1.609725
C   -0.690714   -0.678260   -0.669685    0.938821   -0.425538    0.575006
D    0.383687   -1.068075    1.268829   -0.736841   -0.541836    0.272954
F   -0.746378   -1.184060   -0.506458    0.238547    0.890689   -0.717013

In [23]:
df.head()

                   A         B         C         D         F
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547
2013-01-05  0.132034  1.333239 -0.425538 -0.541836  0.890689

DataFrame.sort_index() sorts by an axis:

In [24]:
df.sort_index(axis=1, ascending=False)

                   F         D         C         B         A
2013-01-01 -0.746378  0.383687 -0.690714 -0.519609  0.347219
2013-01-02 -1.184060 -1.068075 -0.678260  0.176982 -0.994325
2013-01-03 -0.506458  1.268829 -0.669685  2.085175  0.434594
2013-01-04  0.238547 -0.736841  0.938821 -0.411070  2.682834
2013-01-05  0.890689 -0.541836 -0.425538  1.333239  0.132034
2013-01-06 -0.717013  0.272954  0.575006  1.609725  0.686671

In [25]:
df.sort_index(axis=0, ascending=True)

                   A         B         C         D         F
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547
2013-01-05  0.132034  1.333239 -0.425538 -0.541836  0.890689
2013-01-06  0.686671  1.609725  0.575006  0.272954 -0.717013

DataFrame.sort_values() sorts by values:

In [26]:
df.sort_values(by="B")

                   A         B         C         D         F
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-05  0.132034  1.333239 -0.425538 -0.541836  0.890689
2013-01-06  0.686671  1.609725  0.575006  0.272954 -0.717013
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458

# Getitem ([])

In [27]:
df[["A", "B", "C"]]

                   A         B         C
2013-01-01  0.347219 -0.519609 -0.690714
2013-01-02 -0.994325  0.176982 -0.678260
2013-01-03  0.434594  2.085175 -0.669685
2013-01-04  2.682834 -0.411070  0.938821
2013-01-05  0.132034  1.333239 -0.425538
2013-01-06  0.686671  1.609725  0.575006

In [28]:
df["A"]

2013-01-01    0.347219
2013-01-02   -0.994325
2013-01-03    0.434594
2013-01-04    2.682834
2013-01-05    0.132034
2013-01-06    0.686671
Freq: D, Name: A, dtype: float64

DataFrame Slice : selects matching rows:

In [29]:
df[0:4]

                   A         B         C         D         F
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547

In [30]:
df["20130102":"20130104"]

                   A         B         C         D         F
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547

Selection by label. Selection by Label using DataFrame.loc() or DataFrame.at().

Selecting a row matching a label:

In [31]:
df.loc[dates[0]]

A    0.347219
B   -0.519609
C   -0.690714
D    0.383687
F   -0.746378
Name: 2013-01-01 00:00:00, dtype: float64

Selecting all rows (:) with a select column labels:

In [32]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.347219 -0.519609
2013-01-02 -0.994325  0.176982
2013-01-03  0.434594  2.085175
2013-01-04  2.682834 -0.411070
2013-01-05  0.132034  1.333239
2013-01-06  0.686671  1.609725

For label slicing, both endpoints are included:

In [33]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.994325  0.176982
2013-01-03  0.434594  2.085175
2013-01-04  2.682834 -0.411070

Selecting a single row and column label returns a scalar:

In [34]:
df.loc[dates[0], "A"]

0.34721939013950404

Selecting a single row and column label returns a scalar:

In [35]:
df.at[dates[1], "A"]

-0.9943253112426477

# Selection by position

In [46]:
df.iloc[0:4]

                   A         B         C         D         F
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547

In [36]:
df.iloc[3]

A    2.682834
B   -0.411070
C    0.938821
D   -0.736841
F    0.238547
Name: 2013-01-04 00:00:00, dtype: float64

In [37]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  2.682834 -0.411070
2013-01-05  0.132034  1.333239

Lists of integer position locations:

In [38]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.994325 -0.678260
2013-01-03  0.434594 -0.669685
2013-01-05  0.132034 -0.425538

For slicing rows explicitly:

In [39]:
df.iloc[1:3, :]

                   A         B         C         D         F
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458

For slicing columns explicitly:

In [40]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.519609 -0.690714
2013-01-02  0.176982 -0.678260
2013-01-03  2.085175 -0.669685
2013-01-04 -0.411070  0.938821
2013-01-05  1.333239 -0.425538
2013-01-06  1.609725  0.575006

For getting a value explicitly:

In [41]:
df.iat[1, 1]

0.1769816504773174

In [48]:
df.iat[1, 2]

-0.6782596304366916

# Boolean indexing
Select rows where df.A is greater than 0

In [42]:
df[df["A"] > 0]

                   A         B         C         D         F
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547
2013-01-05  0.132034  1.333239 -0.425538 -0.541836  0.890689
2013-01-06  0.686671  1.609725  0.575006  0.272954 -0.717013

Selecting values from a DataFrame where a boolean condition is met:

In [43]:
df[df > 0.5]

                   A         B         C         D         F
2013-01-01       NaN       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN       NaN
2013-01-03       NaN  2.085175       NaN  1.268829       NaN
2013-01-04  2.682834       NaN  0.938821       NaN       NaN
2013-01-05       NaN  1.333239       NaN       NaN  0.890689
2013-01-06  0.686671  1.609725  0.575006       NaN       NaN

Using isin() method for filtering:

In [44]:
dfcopy = df.copy()
dfcopy["E"] = ["one", "one", "two", "three", "four", "three"]
dfcopy

                   A         B         C         D         F      E
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378    one
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060    one
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458    two
2013-01-04  2.682834 -0.411070  0.938821 -0.736841  0.238547  three
2013-01-05  0.132034  1.333239 -0.425538 -0.541836  0.890689   four
2013-01-06  0.686671  1.609725  0.575006  0.272954 -0.717013  three

In [49]:
dfcopy[dfcopy["E"].isin(["one", "two", "four"])]

                   A         B         C         D         F     E
2013-01-01  0.347219 -0.519609 -0.690714  0.383687 -0.746378   one
2013-01-02 -0.994325  0.176982 -0.678260 -1.068075 -1.184060   one
2013-01-03  0.434594  2.085175 -0.669685  1.268829 -0.506458   two
2013-01-05  0.132034  1.333239 -0.425538 -0.541836  0.890689  four

Setting a new column automatically aligns the data by the indexes: